app/controllers/hospitals_controller.rb

SELECT "hospitals".* FROM "hospitals"
---
  def index
    @hospitals = Hospital.all

SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT 1  [["id", 4]]
---
  def show
    @hospital = Hospital.find(params[:id])